use proc_macro2::TokenStream;
use quote::quote;
use syn::parse2;

use crate::{
    character_classes::CharacterClasses, nfa::Nfa, scanner_data::ScannerData,
    scanner_mode::ScannerMode,
};

/// This function generates the scanner code from the input token stream.
/// It parses the input token stream into a `ScannerData` struct and then generates the scanner
/// code.
/// It returns a `TokenStream` containing the generated code.
/// The input token stream is expected to contain the scanner definition, including the regex
/// patterns and actions.
/// The macro syntax is expected to be used in the following way:
/// ```ignore
/// use scnr_macro::scanner;
///
/// scanner! {
///     ExampleScanner {
///         mode INITIAL {
///             token r"\r\n|\r|\n" => 1;
///             token r"[\s--\r\n]+" => 2;
///             token r"//.*(\r\n|\r|\n)?" => 3;
///             token r"/\*([^*]|\*[^/])*\*/" => 4;
///             token r#"""# => 8;
///             token r"Hello" => 9;
///             token r"World" => 10;
///             token r"World" => 11 followed by r"!";
///             token r"!" => 12 not followed by r"!";
///             token r"[a-zA-Z_]\w*" => 13;
///             token r"." => 14;
///
///             transition 8 => STRING;
///         }
///         mode STRING {
///             token r#"\\[\"\\bfnt]"# => 5;
///             token r"\\[\s--\n\r]*\r?\n" => 6;
///             token r#"[^\"\]+"# => 7;
///             token r#"""# => 8;
///             token r"." => 14;
///
///             transition 8 => INITIAL;
//          }
///     }
/// }
/// ```
/// where there must be at least one scanner mode with at least one `token` entry.
/// A `token` entry is a regex pattern followed by an arrow and a token type number.
/// Optional `not` and `followed by` modifiers can be used to specify positive and negative
/// lookaheads.
/// Zero or more `transition` entries can exist.
/// The `transition` entries are tuples of the token type numbers and the new scanner mode name.
///
/// The generated code will include the scanner implementation.
/// The generated scanner in this example will be a struct named `ExampleScanner` which implements
/// the `ScannerTrait`.
pub fn generate(input: TokenStream) -> TokenStream {
    let scanner_data: ScannerData = parse2(input).expect("Failed to parse input");
    let scanner_modes: Vec<ScannerMode> = scanner_data
        .build_scanner_modes()
        .expect("Failed to build scanner modes");

    // Generate NFAs for each scanner mode
    let mut nfas = scanner_modes
        .iter()
        .map(|mode| {
            // Build the NFA for each pattern in the scanner mode
            Nfa::build_from_patterns(&mode.patterns).expect("Failed to build NFA for pattern")
        })
        .collect::<Vec<_>>();

    let mut character_classes = CharacterClasses::new();
    // For each NFA, generate the character classes
    for nfa in &nfas {
        nfa.collect_character_classes(&mut character_classes)
    }
    // Generate disjoint character classes
    character_classes.create_disjoint_character_classes();
    // Convert the NFA to use disjoint character classes
    for nfa in &mut nfas {
        nfa.convert_to_disjoint_character_classes(&character_classes);
    }

    // Make the scanner name an syn::Ident
    let scanner_name = syn::Ident::new(&scanner_data.name, proc_macro2::Span::call_site());
    let match_function_code = character_classes.generate("match_function");

    let output = quote! {
        struct #scanner_name {}

        impl #scanner_name {
            fn new() -> Self {
                #scanner_name {}
            }
            #match_function_code
        }
    };

    output
}

#[cfg(test)]
mod tests {
    use std::io::Write;

    use super::*;

    use crate::Result;
    use std::path::Path;

    use std::process::Command;

    /// Tries to format the source code of a given file.
    fn try_format(path_to_file: &Path) -> Result<()> {
        Command::new("rustfmt")
            .args([path_to_file])
            .status()
            .map(|_| ())
            .map_err(|e| {
                std::io::Error::new(e.kind(), format!("Failed to format file: {}", e)).into()
            })
    }

    #[test]
    fn test_generate() {
        let input = quote::quote! {
            HelloWorld {
                mode INITIAL {
                    token r"\r\n|\r|\n" => 1;
                    token r"[\s--\r\n]+" => 2;
                    token r"//.*(\r\n|\r|\n)?" => 3;
                    token r"/\*([^*]|\*[^/])*\*/" => 4;
                    token r#"""# => 8;
                    token r"Hello" => 9;
                    token r"World" => 10;
                    token r"World" => 11 followed by r"!";
                    token r"!" => 12 not followed by r"!";
                    token r"[a-zA-Z_]\w*" => 13;
                    token r"." => 14;

                    transition 8 => STRING;
                }
                mode STRING {
                    token r#"\\[\"\\bfnt]"# => 5;
                    token r"\\[\s--\r\n]*\r?\n" => 6;
                    token r#"[^\"\\]+"# => 7;
                    token r#"""# => 8;
                    token r"." => 14;

                    transition 8 => INITIAL;
                }
            }
        };
        let code = generate(input).to_string();

        // Create a temporary file
        let mut temp_file =
            tempfile::NamedTempFile::new().expect("Failed to create temporary file");

        // Write the generated code to the temporary file
        temp_file
            .write_all(code.as_bytes())
            .expect("Failed to write to temporary file");

        // Optionally, print the file path for debugging
        println!("Temporary file created at: {:?}", temp_file.path());

        // Format the file (if needed)
        try_format(temp_file.path()).expect("Failed to format the temporary file");

        // Load the formatted code and convert possible \r\n to \n for easier comparison
        let formatted_code = std::fs::read_to_string(temp_file.path())
            .expect("Failed to read the formatted temporary file")
            .replace("\r\n", "\n");

        let expected_code = r#"struct HelloWorld {}
impl HelloWorld {
    fn new() -> Self {
        HelloWorld {}
    }
    #[allow(clippy::manual_is_ascii_check, dead_code)]
    pub(crate) fn match_function(char_class: usize, c: char) -> bool {
        use std::cmp::Ordering;
        static CHAR_CLASS_TABLE: &[&[std::ops::RangeInclusive<char>]] = &[
            &['\r'..='\r'],
            &['\n'..='\n'],
            {
                &[
                    '\t'..='\t',
                    '\u{b}'..='\u{c}',
                    ' '..=' ',
                    '\u{85}'..='\u{85}',
                    '\u{a0}'..='\u{a0}',
                    '\u{1680}'..='\u{1680}',
                    '\u{2000}'..='\u{200a}',
                    '\u{2028}'..='\u{2029}',
                    '\u{202f}'..='\u{202f}',
                    '\u{205f}'..='\u{205f}',
                    '\u{3000}'..='\u{3000}',
                ]
            },
            &['/'..='/'],
            { &['\0'..='\t', '\u{b}'..='\u{10ffff}'] },
            &['*'..='*'],
            { &['\0'..=')', '+'..='\u{10ffff}'] },
            { &['\0'..='.', '0'..='\u{10ffff}'] },
            &['"'..='"'],
            &['H'..='H'],
            &['e'..='e'],
            &['l'..='l'],
            &['o'..='o'],
            &['W'..='W'],
            &['r'..='r'],
            &['d'..='d'],
            &['!'..='!'],
            { &['A'..='Z', '_'..='_', 'a'..='z'] },
            {
                &[
                    '0'..='9',
                    'A'..='Z',
                    '_'..='_',
                    'a'..='z',
                    'ª'..='ª',
                    'µ'..='µ',
                    'º'..='º',
                    'À'..='Ö',
                    'Ø'..='ö',
                    'ø'..='ˁ',
                    'ˆ'..='ˑ',
                    'ˠ'..='ˤ',
                    'ˬ'..='ˬ',
                    'ˮ'..='ˮ',
                    '\u{300}'..='ʹ',
                    'Ͷ'..='ͷ',
                    'ͺ'..='ͽ',
                    'Ϳ'..='Ϳ',
                    'Ά'..='Ά',
                    'Έ'..='Ί',
                    'Ό'..='Ό',
                    'Ύ'..='Ρ',
                    'Σ'..='ϵ',
                    'Ϸ'..='ҁ',
                    '\u{483}'..='ԯ',
                    'Ա'..='Ֆ',
                    'ՙ'..='ՙ',
                    'ՠ'..='ֈ',
                    '\u{591}'..='\u{5bd}',
                    '\u{5bf}'..='\u{5bf}',
                    '\u{5c1}'..='\u{5c2}',
                    '\u{5c4}'..='\u{5c5}',
                    '\u{5c7}'..='\u{5c7}',
                    'א'..='ת',
                    'ׯ'..='ײ',
                    '\u{610}'..='\u{61a}',
                    'ؠ'..='٩',
                    'ٮ'..='ۓ',
                    'ە'..='\u{6dc}',
                    '\u{6df}'..='\u{6e8}',
                    '\u{6ea}'..='ۼ',
                    'ۿ'..='ۿ',
                    'ܐ'..='\u{74a}',
                    'ݍ'..='ޱ',
                    '߀'..='ߵ',
                    'ߺ'..='ߺ',
                    '\u{7fd}'..='\u{7fd}',
                    'ࠀ'..='\u{82d}',
                    'ࡀ'..='\u{85b}',
                    'ࡠ'..='ࡪ',
                    'ࡰ'..='ࢇ',
                    'ࢉ'..='ࢎ',
                    '\u{897}'..='\u{8e1}',
                    '\u{8e3}'..='\u{963}',
                    '०'..='९',
                    'ॱ'..='ঃ',
                    'অ'..='ঌ',
                    'এ'..='ঐ',
                    'ও'..='ন',
                    'প'..='র',
                    'ল'..='ল',
                    'শ'..='হ',
                    '\u{9bc}'..='\u{9c4}',
                    'ে'..='ৈ',
                    'ো'..='ৎ',
                    '\u{9d7}'..='\u{9d7}',
                    'ড়'..='ঢ়',
                    'য়'..='\u{9e3}',
                    '০'..='ৱ',
                    'ৼ'..='ৼ',
                    '\u{9fe}'..='\u{9fe}',
                    '\u{a01}'..='ਃ',
                    'ਅ'..='ਊ',
                    'ਏ'..='ਐ',
                    'ਓ'..='ਨ',
                    'ਪ'..='ਰ',
                    'ਲ'..='ਲ਼',
                    'ਵ'..='ਸ਼',
                    'ਸ'..='ਹ',
                    '\u{a3c}'..='\u{a3c}',
                    'ਾ'..='\u{a42}',
                    '\u{a47}'..='\u{a48}',
                    '\u{a4b}'..='\u{a4d}',
                    '\u{a51}'..='\u{a51}',
                    'ਖ਼'..='ੜ',
                    'ਫ਼'..='ਫ਼',
                    '੦'..='\u{a75}',
                    '\u{a81}'..='ઃ',
                    'અ'..='ઍ',
                    'એ'..='ઑ',
                    'ઓ'..='ન',
                    'પ'..='ર',
                    'લ'..='ળ',
                    'વ'..='હ',
                    '\u{abc}'..='\u{ac5}',
                    '\u{ac7}'..='ૉ',
                    'ો'..='\u{acd}',
                    'ૐ'..='ૐ',
                    'ૠ'..='\u{ae3}',
                    '૦'..='૯',
                    'ૹ'..='\u{aff}',
                    '\u{b01}'..='ଃ',
                    'ଅ'..='ଌ',
                    'ଏ'..='ଐ',
                    'ଓ'..='ନ',
                    'ପ'..='ର',
                    'ଲ'..='ଳ',
                    'ଵ'..='ହ',
                    '\u{b3c}'..='\u{b44}',
                    'େ'..='ୈ',
                    'ୋ'..='\u{b4d}',
                    '\u{b55}'..='\u{b57}',
                    'ଡ଼'..='ଢ଼',
                    'ୟ'..='\u{b63}',
                    '୦'..='୯',
                    'ୱ'..='ୱ',
                    '\u{b82}'..='ஃ',
                    'அ'..='ஊ',
                    'எ'..='ஐ',
                    'ஒ'..='க',
                    'ங'..='ச',
                    'ஜ'..='ஜ',
                    'ஞ'..='ட',
                    'ண'..='த',
                    'ந'..='ப',
                    'ம'..='ஹ',
                    '\u{bbe}'..='ூ',
                    'ெ'..='ை',
                    'ொ'..='\u{bcd}',
                    'ௐ'..='ௐ',
                    '\u{bd7}'..='\u{bd7}',
                    '௦'..='௯',
                    '\u{c00}'..='ఌ',
                    'ఎ'..='ఐ',
                    'ఒ'..='న',
                    'ప'..='హ',
                    '\u{c3c}'..='ౄ',
                    '\u{c46}'..='\u{c48}',
                    '\u{c4a}'..='\u{c4d}',
                    '\u{c55}'..='\u{c56}',
                    'ౘ'..='ౚ',
                    'ౝ'..='ౝ',
                    'ౠ'..='\u{c63}',
                    '౦'..='౯',
                    'ಀ'..='ಃ',
                    'ಅ'..='ಌ',
                    'ಎ'..='ಐ',
                    'ಒ'..='ನ',
                    'ಪ'..='ಳ',
                    'ವ'..='ಹ',
                    '\u{cbc}'..='ೄ',
                    '\u{cc6}'..='\u{cc8}',
                    '\u{cca}'..='\u{ccd}',
                    '\u{cd5}'..='\u{cd6}',
                    'ೝ'..='ೞ',
                    'ೠ'..='\u{ce3}',
                    '೦'..='೯',
                    'ೱ'..='ೳ',
                    '\u{d00}'..='ഌ',
                    'എ'..='ഐ',
                    'ഒ'..='\u{d44}',
                    'െ'..='ൈ',
                    'ൊ'..='ൎ',
                    'ൔ'..='\u{d57}',
                    'ൟ'..='\u{d63}',
                    '൦'..='൯',
                    'ൺ'..='ൿ',
                    '\u{d81}'..='ඃ',
                    'අ'..='ඖ',
                    'ක'..='න',
                    'ඳ'..='ර',
                    'ල'..='ල',
                    'ව'..='ෆ',
                    '\u{dca}'..='\u{dca}',
                    '\u{dcf}'..='\u{dd4}',
                    '\u{dd6}'..='\u{dd6}',
                    'ෘ'..='\u{ddf}',
                    '෦'..='෯',
                    'ෲ'..='ෳ',
                    'ก'..='\u{e3a}',
                    'เ'..='\u{e4e}',
                    '๐'..='๙',
                    'ກ'..='ຂ',
                    'ຄ'..='ຄ',
                    'ຆ'..='ຊ',
                    'ຌ'..='ຣ',
                    'ລ'..='ລ',
                    'ວ'..='ຽ',
                    'ເ'..='ໄ',
                    'ໆ'..='ໆ',
                    '\u{ec8}'..='\u{ece}',
                    '໐'..='໙',
                    'ໜ'..='ໟ',
                    'ༀ'..='ༀ',
                    '\u{f18}'..='\u{f19}',
                    '༠'..='༩',
                    '\u{f35}'..='\u{f35}',
                    '\u{f37}'..='\u{f37}',
                    '\u{f39}'..='\u{f39}',
                    '༾'..='ཇ',
                    'ཉ'..='ཬ',
                    '\u{f71}'..='\u{f84}',
                    '\u{f86}'..='\u{f97}',
                    '\u{f99}'..='\u{fbc}',
                    '\u{fc6}'..='\u{fc6}',
                    'က'..='၉',
                    'ၐ'..='\u{109d}',
                    'Ⴀ'..='Ⴥ',
                    'Ⴧ'..='Ⴧ',
                    'Ⴭ'..='Ⴭ',
                    'ა'..='ჺ',
                    'ჼ'..='ቈ',
                    'ቊ'..='ቍ',
                    'ቐ'..='ቖ',
                    'ቘ'..='ቘ',
                    'ቚ'..='ቝ',
                    'በ'..='ኈ',
                    'ኊ'..='ኍ',
                    'ነ'..='ኰ',
                    'ኲ'..='ኵ',
                    'ኸ'..='ኾ',
                    'ዀ'..='ዀ',
                    'ዂ'..='ዅ',
                    'ወ'..='ዖ',
                    'ዘ'..='ጐ',
                    'ጒ'..='ጕ',
                    'ጘ'..='ፚ',
                    '\u{135d}'..='\u{135f}',
                    'ᎀ'..='ᎏ',
                    'Ꭰ'..='Ᏽ',
                    'ᏸ'..='ᏽ',
                    'ᐁ'..='ᙬ',
                    'ᙯ'..='ᙿ',
                    'ᚁ'..='ᚚ',
                    'ᚠ'..='ᛪ',
                    'ᛮ'..='ᛸ',
                    'ᜀ'..='\u{1715}',
                    'ᜟ'..='\u{1734}',
                    'ᝀ'..='\u{1753}',
                    'ᝠ'..='ᝬ',
                    'ᝮ'..='ᝰ',
                    '\u{1772}'..='\u{1773}',
                    'ក'..='\u{17d3}',
                    'ៗ'..='ៗ',
                    'ៜ'..='\u{17dd}',
                    '០'..='៩',
                    '\u{180b}'..='\u{180d}',
                    '\u{180f}'..='᠙',
                    'ᠠ'..='ᡸ',
                    'ᢀ'..='ᢪ',
                    'ᢰ'..='ᣵ',
                    'ᤀ'..='ᤞ',
                    '\u{1920}'..='ᤫ',
                    'ᤰ'..='\u{193b}',
                    '᥆'..='ᥭ',
                    'ᥰ'..='ᥴ',
                    'ᦀ'..='ᦫ',
                    'ᦰ'..='ᧉ',
                    '᧐'..='᧙',
                    'ᨀ'..='\u{1a1b}',
                    'ᨠ'..='\u{1a5e}',
                    '\u{1a60}'..='\u{1a7c}',
                    '\u{1a7f}'..='᪉',
                    '᪐'..='᪙',
                    'ᪧ'..='ᪧ',
                    '\u{1ab0}'..='\u{1ace}',
                    '\u{1b00}'..='ᭌ',
                    '᭐'..='᭙',
                    '\u{1b6b}'..='\u{1b73}',
                    '\u{1b80}'..='\u{1bf3}',
                    'ᰀ'..='\u{1c37}',
                    '᱀'..='᱉',
                    'ᱍ'..='ᱽ',
                    'ᲀ'..='ᲊ',
                    'Ა'..='Ჺ',
                    'Ჽ'..='Ჿ',
                    '\u{1cd0}'..='\u{1cd2}',
                    '\u{1cd4}'..='ᳺ',
                    'ᴀ'..='ἕ',
                    'Ἐ'..='Ἕ',
                    'ἠ'..='ὅ',
                    'Ὀ'..='Ὅ',
                    'ὐ'..='ὗ',
                    'Ὑ'..='Ὑ',
                    'Ὓ'..='Ὓ',
                    'Ὕ'..='Ὕ',
                    'Ὗ'..='ώ',
                    'ᾀ'..='ᾴ',
                    'ᾶ'..='ᾼ',
                    'ι'..='ι',
                    'ῂ'..='ῄ',
                    'ῆ'..='ῌ',
                    'ῐ'..='ΐ',
                    'ῖ'..='Ί',
                    'ῠ'..='Ῥ',
                    'ῲ'..='ῴ',
                    'ῶ'..='ῼ',
                    '\u{200c}'..='\u{200d}',
                    '‿'..='⁀',
                    '⁔'..='⁔',
                    'ⁱ'..='ⁱ',
                    'ⁿ'..='ⁿ',
                    'ₐ'..='ₜ',
                    '\u{20d0}'..='\u{20f0}',
                    'ℂ'..='ℂ',
                    'ℇ'..='ℇ',
                    'ℊ'..='ℓ',
                    'ℕ'..='ℕ',
                    'ℙ'..='ℝ',
                    'ℤ'..='ℤ',
                    'Ω'..='Ω',
                    'ℨ'..='ℨ',
                    'K'..='ℭ',
                    'ℯ'..='ℹ',
                    'ℼ'..='ℿ',
                    'ⅅ'..='ⅉ',
                    'ⅎ'..='ⅎ',
                    'Ⅰ'..='ↈ',
                    'Ⓐ'..='ⓩ',
                    'Ⰰ'..='ⳤ',
                    'Ⳬ'..='ⳳ',
                    'ⴀ'..='ⴥ',
                    'ⴧ'..='ⴧ',
                    'ⴭ'..='ⴭ',
                    'ⴰ'..='ⵧ',
                    'ⵯ'..='ⵯ',
                    '\u{2d7f}'..='ⶖ',
                    'ⶠ'..='ⶦ',
                    'ⶨ'..='ⶮ',
                    'ⶰ'..='ⶶ',
                    'ⶸ'..='ⶾ',
                    'ⷀ'..='ⷆ',
                    'ⷈ'..='ⷎ',
                    'ⷐ'..='ⷖ',
                    'ⷘ'..='ⷞ',
                    '\u{2de0}'..='\u{2dff}',
                    'ⸯ'..='ⸯ',
                    '々'..='〇',
                    '〡'..='\u{302f}',
                    '〱'..='〵',
                    '〸'..='〼',
                    'ぁ'..='ゖ',
                    '\u{3099}'..='\u{309a}',
                    'ゝ'..='ゟ',
                    'ァ'..='ヺ',
                    'ー'..='ヿ',
                    'ㄅ'..='ㄯ',
                    'ㄱ'..='ㆎ',
                    'ㆠ'..='ㆿ',
                    'ㇰ'..='ㇿ',
                    '㐀'..='䶿',
                    '一'..='ꒌ',
                    'ꓐ'..='ꓽ',
                    'ꔀ'..='ꘌ',
                    'ꘐ'..='ꘫ',
                    'Ꙁ'..='\u{a672}',
                    '\u{a674}'..='\u{a67d}',
                    'ꙿ'..='\u{a6f1}',
                    'ꜗ'..='ꜟ',
                    'Ꜣ'..='ꞈ',
                    'Ꞌ'..='ꟍ',
                    'Ꟑ'..='ꟑ',
                    'ꟓ'..='ꟓ',
                    'ꟕ'..='Ƛ',
                    'ꟲ'..='ꠧ',
                    '\u{a82c}'..='\u{a82c}',
                    'ꡀ'..='ꡳ',
                    'ꢀ'..='\u{a8c5}',
                    '꣐'..='꣙',
                    '\u{a8e0}'..='ꣷ',
                    'ꣻ'..='ꣻ',
                    'ꣽ'..='\u{a92d}',
                    'ꤰ'..='\u{a953}',
                    'ꥠ'..='ꥼ',
                    '\u{a980}'..='\u{a9c0}',
                    'ꧏ'..='꧙',
                    'ꧠ'..='ꧾ',
                    'ꨀ'..='\u{aa36}',
                    'ꩀ'..='ꩍ',
                    '꩐'..='꩙',
                    'ꩠ'..='ꩶ',
                    'ꩺ'..='ꫂ',
                    'ꫛ'..='ꫝ',
                    'ꫠ'..='ꫯ',
                    'ꫲ'..='\u{aaf6}',
                    'ꬁ'..='ꬆ',
                    'ꬉ'..='ꬎ',
                    'ꬑ'..='ꬖ',
                    'ꬠ'..='ꬦ',
                    'ꬨ'..='ꬮ',
                    'ꬰ'..='ꭚ',
                    'ꭜ'..='ꭩ',
                    'ꭰ'..='ꯪ',
                    '꯬'..='\u{abed}',
                    '꯰'..='꯹',
                    '가'..='힣',
                    'ힰ'..='ퟆ',
                    'ퟋ'..='ퟻ',
                    '豈'..='舘',
                    '並'..='龎',
                    'ﬀ'..='ﬆ',
                    'ﬓ'..='ﬗ',
                    'יִ'..='ﬨ',
                    'שׁ'..='זּ',
                    'טּ'..='לּ',
                    'מּ'..='מּ',
                    'נּ'..='סּ',
                    'ףּ'..='פּ',
                    'צּ'..='ﮱ',
                    'ﯓ'..='ﴽ',
                    'ﵐ'..='ﶏ',
                    'ﶒ'..='ﷇ',
                    'ﷰ'..='ﷻ',
                    '\u{fe00}'..='\u{fe0f}',
                    '\u{fe20}'..='\u{fe2f}',
                    '︳'..='︴',
                    '﹍'..='﹏',
                    'ﹰ'..='ﹴ',
                    'ﹶ'..='ﻼ',
                    '０'..='９',
                    'Ａ'..='Ｚ',
                    '＿'..='＿',
                    'ａ'..='ｚ',
                    'ｦ'..='ﾾ',
                    'ￂ'..='ￇ',
                    'ￊ'..='ￏ',
                    'ￒ'..='ￗ',
                    'ￚ'..='ￜ',
                    '𐀀'..='𐀋',
                    '𐀍'..='𐀦',
                    '𐀨'..='𐀺',
                    '𐀼'..='𐀽',
                    '𐀿'..='𐁍',
                    '𐁐'..='𐁝',
                    '𐂀'..='𐃺',
                    '𐅀'..='𐅴',
                    '\u{101fd}'..='\u{101fd}',
                    '𐊀'..='𐊜',
                    '𐊠'..='𐋐',
                    '\u{102e0}'..='\u{102e0}',
                    '𐌀'..='𐌟',
                    '𐌭'..='𐍊',
                    '𐍐'..='\u{1037a}',
                    '𐎀'..='𐎝',
                    '𐎠'..='𐏃',
                    '𐏈'..='𐏏',
                    '𐏑'..='𐏕',
                    '𐐀'..='𐒝',
                    '𐒠'..='𐒩',
                    '𐒰'..='𐓓',
                    '𐓘'..='𐓻',
                    '𐔀'..='𐔧',
                    '𐔰'..='𐕣',
                    '𐕰'..='𐕺',
                    '𐕼'..='𐖊',
                    '𐖌'..='𐖒',
                    '𐖔'..='𐖕',
                    '𐖗'..='𐖡',
                    '𐖣'..='𐖱',
                    '𐖳'..='𐖹',
                    '𐖻'..='𐖼',
                    '𐗀'..='𐗳',
                    '𐘀'..='𐜶',
                    '𐝀'..='𐝕',
                    '𐝠'..='𐝧',
                    '𐞀'..='𐞅',
                    '𐞇'..='𐞰',
                    '𐞲'..='𐞺',
                    '𐠀'..='𐠅',
                    '𐠈'..='𐠈',
                    '𐠊'..='𐠵',
                    '𐠷'..='𐠸',
                    '𐠼'..='𐠼',
                    '𐠿'..='𐡕',
                    '𐡠'..='𐡶',
                    '𐢀'..='𐢞',
                    '𐣠'..='𐣲',
                    '𐣴'..='𐣵',
                    '𐤀'..='𐤕',
                    '𐤠'..='𐤹',
                    '𐦀'..='𐦷',
                    '𐦾'..='𐦿',
                    '𐨀'..='\u{10a03}',
                    '\u{10a05}'..='\u{10a06}',
                    '\u{10a0c}'..='𐨓',
                    '𐨕'..='𐨗',
                    '𐨙'..='𐨵',
                    '\u{10a38}'..='\u{10a3a}',
                    '\u{10a3f}'..='\u{10a3f}',
                    '𐩠'..='𐩼',
                    '𐪀'..='𐪜',
                    '𐫀'..='𐫇',
                    '𐫉'..='\u{10ae6}',
                    '𐬀'..='𐬵',
                    '𐭀'..='𐭕',
                    '𐭠'..='𐭲',
                    '𐮀'..='𐮑',
                    '𐰀'..='𐱈',
                    '𐲀'..='𐲲',
                    '𐳀'..='𐳲',
                    '𐴀'..='\u{10d27}',
                    '𐴰'..='𐴹',
                    '𐵀'..='𐵥',
                    '\u{10d69}'..='\u{10d6d}',
                    '𐵯'..='𐶅',
                    '𐺀'..='𐺩',
                    '\u{10eab}'..='\u{10eac}',
                    '𐺰'..='𐺱',
                    '𐻂'..='𐻄',
                    '\u{10efc}'..='𐼜',
                    '𐼧'..='𐼧',
                    '𐼰'..='\u{10f50}',
                    '𐽰'..='\u{10f85}',
                    '𐾰'..='𐿄',
                    '𐿠'..='𐿶',
                    '𑀀'..='\u{11046}',
                    '𑁦'..='𑁵',
                    '\u{1107f}'..='\u{110ba}',
                    '\u{110c2}'..='\u{110c2}',
                    '𑃐'..='𑃨',
                    '𑃰'..='𑃹',
                    '\u{11100}'..='\u{11134}',
                    '𑄶'..='𑄿',
                    '𑅄'..='𑅇',
                    '𑅐'..='\u{11173}',
                    '𑅶'..='𑅶',
                    '\u{11180}'..='𑇄',
                    '\u{111c9}'..='\u{111cc}',
                    '𑇎'..='𑇚',
                    '𑇜'..='𑇜',
                    '𑈀'..='𑈑',
                    '𑈓'..='\u{11237}',
                    '\u{1123e}'..='\u{11241}',
                    '𑊀'..='𑊆',
                    '𑊈'..='𑊈',
                    '𑊊'..='𑊍',
                    '𑊏'..='𑊝',
                    '𑊟'..='𑊨',
                    '𑊰'..='\u{112ea}',
                    '𑋰'..='𑋹',
                    '\u{11300}'..='𑌃',
                    '𑌅'..='𑌌',
                    '𑌏'..='𑌐',
                    '𑌓'..='𑌨',
                    '𑌪'..='𑌰',
                    '𑌲'..='𑌳',
                    '𑌵'..='𑌹',
                    '\u{1133b}'..='𑍄',
                    '𑍇'..='𑍈',
                    '𑍋'..='\u{1134d}',
                    '𑍐'..='𑍐',
                    '\u{11357}'..='\u{11357}',
                    '𑍝'..='𑍣',
                    '\u{11366}'..='\u{1136c}',
                    '\u{11370}'..='\u{11374}',
                    '𑎀'..='𑎉',
                    '𑎋'..='𑎋',
                    '𑎎'..='𑎎',
                    '𑎐'..='𑎵',
                    '𑎷'..='\u{113c0}',
                    '\u{113c2}'..='\u{113c2}',
                    '\u{113c5}'..='\u{113c5}',
                    '\u{113c7}'..='𑏊',
                    '𑏌'..='𑏓',
                    '\u{113e1}'..='\u{113e2}',
                    '𑐀'..='𑑊',
                    '𑑐'..='𑑙',
                    '\u{1145e}'..='𑑡',
                    '𑒀'..='𑓅',
                    '𑓇'..='𑓇',
                    '𑓐'..='𑓙',
                    '𑖀'..='\u{115b5}',
                    '𑖸'..='\u{115c0}',
                    '𑗘'..='\u{115dd}',
                    '𑘀'..='\u{11640}',
                    '𑙄'..='𑙄',
                    '𑙐'..='𑙙',
                    '𑚀'..='𑚸',
                    '𑛀'..='𑛉',
                    '𑛐'..='𑛣',
                    '𑜀'..='𑜚',
                    '\u{1171d}'..='\u{1172b}',
                    '𑜰'..='𑜹',
                    '𑝀'..='𑝆',
                    '𑠀'..='\u{1183a}',
                    '𑢠'..='𑣩',
                    '𑣿'..='𑤆',
                    '𑤉'..='𑤉',
                    '𑤌'..='𑤓',
                    '𑤕'..='𑤖',
                    '𑤘'..='𑤵',
                    '𑤷'..='𑤸',
                    '\u{1193b}'..='\u{11943}',
                    '𑥐'..='𑥙',
                    '𑦠'..='𑦧',
                    '𑦪'..='\u{119d7}',
                    '\u{119da}'..='𑧡',
                    '𑧣'..='𑧤',
                    '𑨀'..='\u{11a3e}',
                    '\u{11a47}'..='\u{11a47}',
                    '𑩐'..='\u{11a99}',
                    '𑪝'..='𑪝',
                    '𑪰'..='𑫸',
                    '𑯀'..='𑯠',
                    '𑯰'..='𑯹',
                    '𑰀'..='𑰈',
                    '𑰊'..='\u{11c36}',
                    '\u{11c38}'..='𑱀',
                    '𑱐'..='𑱙',
                    '𑱲'..='𑲏',
                    '\u{11c92}'..='\u{11ca7}',
                    '𑲩'..='\u{11cb6}',
                    '𑴀'..='𑴆',
                    '𑴈'..='𑴉',
                    '𑴋'..='\u{11d36}',
                    '\u{11d3a}'..='\u{11d3a}',
                    '\u{11d3c}'..='\u{11d3d}',
                    '\u{11d3f}'..='\u{11d47}',
                    '𑵐'..='𑵙',
                    '𑵠'..='𑵥',
                    '𑵧'..='𑵨',
                    '𑵪'..='𑶎',
                    '\u{11d90}'..='\u{11d91}',
                    '𑶓'..='𑶘',
                    '𑶠'..='𑶩',
                    '𑻠'..='𑻶',
                    '\u{11f00}'..='𑼐',
                    '𑼒'..='\u{11f3a}',
                    '𑼾'..='\u{11f42}',
                    '𑽐'..='\u{11f5a}',
                    '𑾰'..='𑾰',
                    '𒀀'..='𒎙',
                    '𒐀'..='𒑮',
                    '𒒀'..='𒕃',
                    '𒾐'..='𒿰',
                    '𓀀'..='𓐯',
                    '\u{13440}'..='\u{13455}',
                    '𓑠'..='𔏺',
                    '𔐀'..='𔙆',
                    '𖄀'..='𖄹',
                    '𖠀'..='𖨸',
                    '𖩀'..='𖩞',
                    '𖩠'..='𖩩',
                    '𖩰'..='𖪾',
                    '𖫀'..='𖫉',
                    '𖫐'..='𖫭',
                    '\u{16af0}'..='\u{16af4}',
                    '𖬀'..='\u{16b36}',
                    '𖭀'..='𖭃',
                    '𖭐'..='𖭙',
                    '𖭣'..='𖭷',
                    '𖭽'..='𖮏',
                    '𖵀'..='𖵬',
                    '𖵰'..='𖵹',
                    '𖹀'..='𖹿',
                    '𖼀'..='𖽊',
                    '\u{16f4f}'..='𖾇',
                    '\u{16f8f}'..='𖾟',
                    '𖿠'..='𖿡',
                    '𖿣'..='\u{16fe4}',
                    '\u{16ff0}'..='\u{16ff1}',
                    '𗀀'..='𘟷',
                    '𘠀'..='𘳕',
                    '𘳿'..='𘴈',
                    '𚿰'..='𚿳',
                    '𚿵'..='𚿻',
                    '𚿽'..='𚿾',
                    '𛀀'..='𛄢',
                    '𛄲'..='𛄲',
                    '𛅐'..='𛅒',
                    '𛅕'..='𛅕',
                    '𛅤'..='𛅧',
                    '𛅰'..='𛋻',
                    '𛰀'..='𛱪',
                    '𛱰'..='𛱼',
                    '𛲀'..='𛲈',
                    '𛲐'..='𛲙',
                    '\u{1bc9d}'..='\u{1bc9e}',
                    '𜳰'..='𜳹',
                    '\u{1cf00}'..='\u{1cf2d}',
                    '\u{1cf30}'..='\u{1cf46}',
                    '\u{1d165}'..='\u{1d169}',
                    '\u{1d16d}'..='\u{1d172}',
                    '\u{1d17b}'..='\u{1d182}',
                    '\u{1d185}'..='\u{1d18b}',
                    '\u{1d1aa}'..='\u{1d1ad}',
                    '\u{1d242}'..='\u{1d244}',
                    '𝐀'..='𝑔',
                    '𝑖'..='𝒜',
                    '𝒞'..='𝒟',
                    '𝒢'..='𝒢',
                    '𝒥'..='𝒦',
                    '𝒩'..='𝒬',
                    '𝒮'..='𝒹',
                    '𝒻'..='𝒻',
                    '𝒽'..='𝓃',
                    '𝓅'..='𝔅',
                    '𝔇'..='𝔊',
                    '𝔍'..='𝔔',
                    '𝔖'..='𝔜',
                    '𝔞'..='𝔹',
                    '𝔻'..='𝔾',
                    '𝕀'..='𝕄',
                    '𝕆'..='𝕆',
                    '𝕊'..='𝕐',
                    '𝕒'..='𝚥',
                    '𝚨'..='𝛀',
                    '𝛂'..='𝛚',
                    '𝛜'..='𝛺',
                    '𝛼'..='𝜔',
                    '𝜖'..='𝜴',
                    '𝜶'..='𝝎',
                    '𝝐'..='𝝮',
                    '𝝰'..='𝞈',
                    '𝞊'..='𝞨',
                    '𝞪'..='𝟂',
                    '𝟄'..='𝟋',
                    '𝟎'..='𝟿',
                    '\u{1da00}'..='\u{1da36}',
                    '\u{1da3b}'..='\u{1da6c}',
                    '\u{1da75}'..='\u{1da75}',
                    '\u{1da84}'..='\u{1da84}',
                    '\u{1da9b}'..='\u{1da9f}',
                    '\u{1daa1}'..='\u{1daaf}',
                    '𝼀'..='𝼞',
                    '𝼥'..='𝼪',
                    '\u{1e000}'..='\u{1e006}',
                    '\u{1e008}'..='\u{1e018}',
                    '\u{1e01b}'..='\u{1e021}',
                    '\u{1e023}'..='\u{1e024}',
                    '\u{1e026}'..='\u{1e02a}',
                    '𞀰'..='𞁭',
                    '\u{1e08f}'..='\u{1e08f}',
                    '𞄀'..='𞄬',
                    '\u{1e130}'..='𞄽',
                    '𞅀'..='𞅉',
                    '𞅎'..='𞅎',
                    '𞊐'..='\u{1e2ae}',
                    '𞋀'..='𞋹',
                    '𞓐'..='𞓹',
                    '𞗐'..='𞗺',
                    '𞟠'..='𞟦',
                    '𞟨'..='𞟫',
                    '𞟭'..='𞟮',
                    '𞟰'..='𞟾',
                    '𞠀'..='𞣄',
                    '\u{1e8d0}'..='\u{1e8d6}',
                    '𞤀'..='𞥋',
                    '𞥐'..='𞥙',
                    '𞸀'..='𞸃',
                    '𞸅'..='𞸟',
                    '𞸡'..='𞸢',
                    '𞸤'..='𞸤',
                    '𞸧'..='𞸧',
                    '𞸩'..='𞸲',
                    '𞸴'..='𞸷',
                    '𞸹'..='𞸹',
                    '𞸻'..='𞸻',
                    '𞹂'..='𞹂',
                    '𞹇'..='𞹇',
                    '𞹉'..='𞹉',
                    '𞹋'..='𞹋',
                    '𞹍'..='𞹏',
                    '𞹑'..='𞹒',
                    '𞹔'..='𞹔',
                    '𞹗'..='𞹗',
                    '𞹙'..='𞹙',
                    '𞹛'..='𞹛',
                    '𞹝'..='𞹝',
                    '𞹟'..='𞹟',
                    '𞹡'..='𞹢',
                    '𞹤'..='𞹤',
                    '𞹧'..='𞹪',
                    '𞹬'..='𞹲',
                    '𞹴'..='𞹷',
                    '𞹹'..='𞹼',
                    '𞹾'..='𞹾',
                    '𞺀'..='𞺉',
                    '𞺋'..='𞺛',
                    '𞺡'..='𞺣',
                    '𞺥'..='𞺩',
                    '𞺫'..='𞺻',
                    '🄰'..='🅉',
                    '🅐'..='🅩',
                    '🅰'..='🆉',
                    '🯰'..='🯹',
                    '𠀀'..='𪛟',
                    '𪜀'..='𫜹',
                    '𫝀'..='𫠝',
                    '𫠠'..='𬺡',
                    '𬺰'..='𮯠',
                    '𮯰'..='𮹝',
                    '丽'..='𪘀',
                    '𰀀'..='𱍊',
                    '𱍐'..='𲎯',
                    '\u{e0100}'..='\u{e01ef}',
                ]
            },
            &['\\'..='\\'],
            {
                &[
                    '"'..='"',
                    '\\'..='\\',
                    'b'..='b',
                    'f'..='f',
                    'n'..='n',
                    't'..='t',
                ]
            },
            { &['\0'..='!', '#'..='[', ']'..='\u{10ffff}'] },
        ];
        if let Some(ranges) = CHAR_CLASS_TABLE.get(char_class) {
            ranges
                .binary_search_by(|range| {
                    if c < *range.start() {
                        Ordering::Greater
                    } else if c > *range.end() {
                        Ordering::Less
                    } else {
                        Ordering::Equal
                    }
                })
                .is_ok()
        } else {
            false
        }
    }
}
"#;
        assert_eq!(formatted_code, expected_code);
    }
}
